[{"title": "Weekend Discussion Thread for the Weekend of October 14, 2023", "body": "# Come hang with us on [Discord](https://discord.gg/wsbverse)\n\nCheck out last week's [Earnings Thread](https://reddit.com/r/wallstreetbets/s/YLr1wRKkq8) and [Rules](https://www.reddit.com/r/wallstreetbets/wiki/contentguide). DM the [mod inbox](https://www.reddit.com/message/compose/?to=/r/wallstreetbets)", "opinions": ["After today I’m only down $85,108.95 all time.", "Israel delays massive assault on Gaza until Monday's market open", "The first five days after the weekend are the hardest.", "I got the job guys! I start removing catalytic converters at midnight 🥳", "I asked the produce guy if I could try a grape and he said he wouldn’t care if I lit the store on fire with him in it ![img](emote|t5_2th52|4260)", "you suck dick to live. I live to suck dick. \n\nWe are not the same 🙅🏾‍♂️", "“DO NOT TOUCH” must be one of the most terrifying things to read in braille", "Am eating the strongest cough drops known to man right now, 20mg of menthol per candy\n\ntastes like I'm blowing frosty the snowman", "Where are the titties?", "*if you wanna be happy for the rest of your life*", "Say whatever about 🥭.\n\nBut we had ✌🏽.", "How to profit from dumb Bullz:\n\nStep 1) Sell a Call on any stock\n\nStep 2) Wait.\n\nStep 3) let it expire worthless and repeat", "Banned u/fantastic_barack for 69 years for politics", "Whats the difference between 3 🅱️enises and a joke ?\n\nMods can't take a joke ![img](emote|t5_2th52|4271)", "Cozy cabin weekend", "I haven't lost my virginity because I never lose.", "Everyone touches my pregnant gf’s belly and congratulates her but no one caresses my nuts saying well done ![img](emote|t5_2th52|4260)", "u/Fantastic_Barack is on a major coke bender and we’re all along for the ride.", "The first digit of my account went up today. I was at $28 before now crossed the big $30", "This time last year I had a lot of money. Gambled it all away and today I have no money", "Breaking: Jada Pinkett reveals she’s never met Will Smith", "I don’t like people who take drugs, for example: airport security.", "3rd place in the fishing tournament and won the side pot most spots on a red fish. Somebody is getting laid tonight ![img](emote|t5_2th52|8883)", "Some of you weren’t beat with a flip flop in Walmart down the canned goods isle and it shows.", "Imagine pitching the idea of Halloween today for the first time:\n\n*”Yeah, I just want a bunch of kids to come by my house at night, where I then hand them candy or show them a trick. Preferably dressed up”*\n\nStraight to jail", "*sniff sniff*\n\n#🐽", "shut up", "I need a gf or a sugar momma", "The Weekend Thread  🤝 Vaginal Dryness", "The best solution to the Israel-Palestine conflict is for the US to claim all of the land for itself. Annex the land as a US territory and force the Jewish and Muslim populations to live in harmony. \n\nGlory to the American Empire 🇺🇸", "This is like the seventies except the music is sucks and everyone’s fat", "Whoever put the glory hole in this public restroom installed it crooked ![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)\n\nTake pride in your work!!! ![img](emote|t5_2th52|27421)", "Just got off the phone with JPow, told me to remember to stay hydrated", "They say success only comes after many failures.  Well, I've got the failure part down.  My port is wrecked.\n\nJust waiting patiently for success now.", "TIL Im gen Z\n\nAlso im not gay\n\nSo that makes me a minority 😳😳😳🚨", "Went to Victoria secret with the wifey, all the models were fat chicks, disgusting, what have we become as a Society ![img](emote|t5_2th52|4271)", "U/delicioussharticles seems like a douche bag.", "🅱️ob 🅱️arkers 🅱️enis", "I just need a 10x bagger to break back even you whores ![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|8882)", "Drinking gin and tonic from a can and it ain't bad", "I love seeing threads about degens trading 0dte's and then talking about how they developed risk methodologies and plans.", "My grandma said I should only shower once a week to save electricity 😯", "Californias homeless getting some ideas after hearing about Gaza", "People are expecting TSLA and NFLX to crash next week. No, that will not happen. But there’ll be 2 or 3 lesser known stocks that will drill 25 to 30%, and yes, you will miss out on that 50 bagger.", "Brody’s wife in the show Homeland is a fuckin dime, man\n\n\nhttps://i.imgur.com/otuEt8p.jpg\n\n\nPics for science purposes only", "Real picture of me asking money from my dad to trade \n\n    \n 🤡  🫴   🫷🥸", "man I swear life would be perfect if god had blessed me with a million dollars instead of this freakishly small peen ![img](emote|t5_2th52|4260)", "I am watching **The Fall of the House of Usher** on **Netflix**\n\n3 episodes in, **Usher** still has not made an appearance on this show.\n\nPuts on **Netflix**. What a scam", "Briefly went to another part of Reddit. Never again.", "Filled my bath tub with gasoline to save money but now the house smells like gas, I tried febreeze and it’s not cutting it. Advice?", "My new Dyson hairdryer just arrived.\n\nFor what I paid, it better change sheets, do laundry, and make dinner, too.", "CNN is just repeating the same 5 minutes of footage over and over again.", "THERE ARE TOO MANY TERRORISTS", "![img](emote|t5_2th52|4271)\n\nhttps://preview.redd.it/1rwfs4x7p3ub1.jpeg?width=1170&format=pjpg&auto=webp&s=1a8ac689833d2d595da0b36cee059fafc660df9d", "Together, I can beat schizophrenia.", "On shrooms at a work event ama", "Man, I’m not even mad at myself anymore, I’m just disappointed. Had nvda 460p I bought at open and sold for 30% gain, it went on to be a 1200% gain. Fuck", "You wouldn't understand baby.... it's a 🅱️eekend thing 🤷‍♂️", "VIX is a fucking joke\n\nSPY -2%? VIX is up only 3%\n\nSPY -0.5%? VIX is up 20%\n\nSPY +0.1%? VIX is down 10%\n\n![img](emote|t5_2th52|4271)", "At sams club for a nice sit down dinner", "Is there anything more cringe than people on social media doing a skit talking to themselves in different outfits?", "Is it legal for servers to charge 25% and still show you on the pad where to tip and not tell you they already charged 25% ? Wtf is going on in this fukin country man ?", "I’ll lick the coke off her hole, body", "ewwwwww u/VacationLover1 shops at TJ Max ![img](emote|t5_2th52|4640)", "Squirrels are the only animal that can climb down while facing down", "There is self checkout at the Aldi near me.  I still go to the cashier though to be ordered around.", "Taking a bubble bath in my gigantic bathtub.  Just ate tacos at the authentic taco stand.  My bitch taking care of the kid.  AMA", "Mods so ghey they fart actual rainbows", "#There are MILFs in my area who want to fuck me. LMAO🤌", "https://preview.redd.it/qz945un2v2ub1.png?width=1093&format=pjpg&auto=webp&s=a796936bb3b83b1de9c897bbf68087c71b151ecb", "The morbidly obese don't get drafted, so 🫵🏻 are safe.", "You literally can't even make fat jokes anymore. puts on humanity", "I love some McDonalds but damn if you don’t feel one level away from food poisoning afterwards.", "So anyway I started blastin ![img](emote|t5_2th52|4276)", "All we have to do is convince the Swifties that $SPY is hiding the secret new Taylor Swift album lyrics about her new boyfriend inside the stock and the only way to read those lyrics is to buy $SPY. \n\nEconomy will be fixed in a day.", "What possess someone to play YT videos/having FaceTime calls on their phone in public without using earphones... \n\nYou're not the main character; you're a fucking inconsiderate asshole", " \"I try to invest according to the word of God and the power of the Holy Spirit\" \n\n\\-Bill Hwang", "Why am I up so early?  Guess multiple wars got me jacked to the tits while holding these weekend puts…", "Paying taxes is racist and i refuse to partake in such things any more.", "My teeth were stained\n\nSo I went to the dentist\n\n\nAnd he said: Do you smoke or drink coffee?\n\nI said\n\n\nI drink it", "I know its the weekend and most people have better shit to do, but damn, wsb dead lately.", "sometimes you get the weirdest fuckin portions at chipotle. like I really didn't need 50% of the bowl to be lettuce", "He calls me mucus cause I stay in his throat", "we are all just walking fleshlights and dildos", "How many chicks have a bunch of dead friends?\n\nBeing a dude hits different.", "Update #4 since my last one 49 days ago on here. Still sober since 03/25/23, after my wife took the kids and moved across the country. \n\nThough some days have been harder than others cuz how much I miss the kids, I’ve never felt better in my entire life. \n\n\nIt’s amazing what you can accomplish if you truly leverage every ounce of mental and physical capacity. \n\nBeen pushing myself everyday to be the best I can, and not let titles define me anymore, but rather, have me defining the titles instead. \n\nBeen doing great at work, gave my first large tech talk ever, helping my elderly parents and family out more, and bringing positive vibes with anyone new that I meet when I’m out. \n\nAt the end of the day, though I’m still broke, without my family, and even though it’s a long road ahead into whatever the future holds- I am just me. \n\nThx and sorry for the banter ✌🏼", "https://preview.redd.it/ng9jedyw68ub1.png?width=128&format=pjpg&auto=webp&s=92288d89d29475bb1e78374531217f13b6f229fa", "Bedbugs are also in London now. Thanks to French people ![img](emote|t5_2th52|4640)", "#You people scare me! Bring back the daily thread!", "Decided to be friendly & have a meth smoke sesh with the local homeless man. Idk how they get addicted to this, shits nasty.", "First", "#🅱️enis 😮‍💨👌", "Weekend breaaaaaaad!! ![img](emote|t5_2th52|4258) 🍆 🙉", "Bankrupt like the tooth fairy in Alabama", "Nothing wakes a person up faster than the sound of a dog puking in the middle of the night", "Nothing wakes a person up faster than the sound of VacationLover1 puking in the middle of the night", "How the gold upvotes work?  \n  \nStep One: i would like to show this person I appreciated their comment. \n  \nStep two: send real money to some random corporation neither you or the other know", "Alright just financed a few gold upvotes at 4.20% for 69 years ![img](emote|t5_2th52|8882)", "Coke", "As much as a we make cuck jokes on here, no one was cucked harder than Jada Pinkett saying she was “shocked” that Will called her his “wife”", "Time to smoke another bowl! I don’t mind burning through this green", "People need to stop acting like there car needs to be thrown away at 200k mikes. If you drive a Honda or yoda you’re good for a million at least", "I’m a woman of multiple interest. I enjoy r/personalfinance and r/povertyfinace.", "Just found a tick crawling on my arm. Thought it was bearhunter for a second", "I'm gonna eat your ass, Gangnam-style", "Aye yo anyone heard from /u/stockninja39 recently\n\nBc we all rooting for you my dude", "Daily reminder that my 🅿️🅿️ is smaller than yours", "You losers still dress up for halloween? I haven't for years but I plan on doing so this year. I'll dress as the scariest thing I can think of... 0dte SPY Puts. \n\nI'm not sure how I'd pull of that costume but I'll think of something.", "can't stop looking at thots on the internet", "Feeling tired tonight, gonna go sleep after 11:11 😮‍💨👌", "YouTubers calling for Black Monday\n\nDalio calling for WW3\n\nAckman tweeting essays\n\nGame over for bears", "I miss awards.... ![img](emote|t5_2th52|4260)", "[deleted]", "it's important to remember the things we have in common during times like these. dudes in Israel and Gaza both jerking it to Mia Khalifa", "kind of sad that nobody recognized a popular copypasta from like ten years ago.. damn am I getting old\n\nwait it was like 15 years ago. fuck I am getting old", "Currently peeing out my butt ![img](emote|t5_2th52|4260)\n\nGuess I need more fiber.", "Starting to think the most important trading skill is the ability to let go of losses and missed profits and just learn from those mistakes, or just realize sometimes it was bad luck.", "With the new offer to Ford Workers, 20% immediate pay raise, Vegas culinary workers looking at striking with a F1 race next month. keiser workers contract in talks. How can inflation not go higher.", "Pancakes or le waffle?", "Not to be an asshole, but I bet everyone's mother in this sub is\n\n>!really nice and loving and bakes yummy cookies. !<", "I’m too shallow to marry a woman that isn’t beautiful", "Take me down \n\nTo the growler butt city\n\nWhere the ass is mean\n\nAnd the TP’s shitty \n\nOh won’t you please take me home!\n\nYeah yeah!", "As a black person on the weekends I enjoy going over to r/gettingbigger and dm’ing the users my nudes", "They only push notifications I get for post from WSB is always the ‘I lost my life savings in a week, I am done’ ones, how does it know those are my fav to jack it to", "Ugh my allergies are blowing up today", "They Them pronouns are ghey", "I hope I get reincarnated as a hot girl", "#calls on beachfront property in Gaza", "Selena Gomez is 31?? bro I feel fucking old", "I actually don't mind the weekend. It's a rather nice break from losing money. ![img](emote|t5_2th52|8883)", "No bro I’m not into that, I like women", "Imagine living somewhere that doesn’t have H‑E‑B. You poor fucks.", "Cash is indeed a position.", "Netflix puts![img](emote|t5_2th52|12787)", "I love Country women", "My husband had a fishing tournament today. He thinks he might have a chance at placing. ![img](emote|t5_2th52|8883)", "I was trying to help your sore throat but you blocked me. ![img](emote|t5_2th52|4260)\n\nBut sore throats suck:\n\nOne shot of whiskey, warmed, add teaspoon of honey, a dash of lemon juice, and a piece of cinnamon bark.\n\n[Irish hot toddy](https://en.m.wikipedia.org/wiki/Hot_toddy)", "Meeseeks is stalking me. And he is posting pictures he took of me pooping as proof.", "I am going to play with my hair dryer. ![img](emote|t5_2th52|31226)", "Selena Gomez needs to quit singing stupid songs and just start doing porn", "*steps out of the short bus*\n\n🅱️eekend 🅱️hread gang we here ![img](emote|t5_2th52|8882)", "[deleted]", "I wasn’t feeling like going to work at all today just wanted to smoke weed and drink all day. I’m a pregnant man so I told them I was at the hospital giving birth, but baby not really due for another 6 weeks and now I can’t go back to work because they will see I’m still pregnant", "I tried to remarry my ex-wife but she figured out I was only after my money", "Uber eats drivers are always one letter off from having a real name", "How do u swallow the pill that you’re probably just gonna be an average Joe? Never bitten by a radioactive spider. Never own a cruise ship. Never be able to fly. Just another Joe  ![img](emote|t5_2th52|4260)", "Taking a smelly shit rn 😮‍💨👌\n\nhttps://preview.redd.it/kpjx6yjg18ub1.png?width=493&format=pjpg&auto=webp&s=2a9837e289660ec64e5f68b1853da25e074b8f24", "Fucking 2 hours late, what are we paying you for?            ![img](emote|t5_2th52|31225)🤡", "Type of day to make 5 different moves and make $78. Still ended in the green tho 🤌🤌", "*takes an impossibly long hit of a fatass blunt, looks up at you glassy eyed*\n\n“I mean, yeah…mods are regarded af, but your mom being the whore she is…\n\n*coughs*\n\n“…sort of offsets it all in the grand scheme.”", "Wholly shit\n\nthe 5 whole adverts I saw this week were absolutel fucking disgusting.\n\nPonies, raindbows, and poor jewish girls dying horribly.\n\ntell me its 'both sideism' without showing me shock cultures you freaks.\n\nabsolute rejection", "I'm in a Korean BBQ mood", "Shout out to all the fine ass Israeli girls out there", "My elderly relatives liked to tease me at weddings, saying, “You’ll be next!” They soon stopped though, once I started doing the same to them at funerals.", "SPY still dumping.. like how lol", "I need a chocolate milk and a lawyer.", "Headed on vacation Thursday. I can’t fucking wait.", "The older I get the more I value intelligence in attractiveness ![img](emote|t5_2th52|29637)", "Does Powell ever go against market sentiment? Because right now the Fedwatch has no more rate hikes priced in. ![img](emote|t5_2th52|12787)", "The first girl I met off of tinder ended up only having one arm…. The second one appeared to have no tattoos until she sent me boobs pics with spider webs around her nips ![img](emote|t5_2th52|18630)", "In-laws are visiting for the weekend, 4 hours in and the next person to cough I’m sending through a fucking wall.", "on god I’m more stoned than a biblical whore", "Hit my pen in the parking lot of the gym and now I feel like everyone is staring at me", "/u/VacationLover1 sent me feet pics\n\nThat boy a mf hobbit ![gif](emote|free_emotes_pack|heart_eyes)", "My bad, I didn’t intend to fall asleep inside you", "[https://imgur.com/a/QR4sUuu](https://imgur.com/a/QR4sUuu)\n\nShe convinced me to hold the puts ![img](emote|t5_2th52|4271)\n\nYou’re afraid to tell your girl about your gambling.\n\nWe are not the same.", "That Tesla Autist who posted about 260 puts last night was actually right ![img](emote|t5_2th52|4271)", "Ever since I was a young boy growing up in Bulgaria.", "I have a hard time imagining it’s actually adults with margin accounts behind these keyboards sometimes", "Lol", "We need a big sad pepe chain", "I’m on a date rn\n\nBye", "Petition to replace Bernanke on the banner with Mr. MeeSeeks.\n\nThat is all.\n\n![img](emote|t5_2th52|31226)", "Regareds get drafted first 🫵🤡", "SPY closed at the same 432 2 years ago today, has been a flat return over the 2 years, a negative return with inflation ![img](emote|t5_2th52|4267)", "Oh you like stocks? Tell me AAPL share price for the last ten years on the minute chart. Before and after hours too.", "AMC thread pops up on feed, they are talking about Taylor Swift investing her gains in AMC because her dad was screwed over by hedge funds. \n\n\nReddit is really where mental illness met wall street", "I keep track of my slot plays for shits and giggles. Only 1/9 time I walked out in the positive, today being my worst session @ -93% of stating budget.\n\nThe machine literally ate the whole thing & spat on me. Friday the 13th really be spooky. ![img](emote|t5_2th52|4260)", "Can someone please DM the Adam Aron dick pics. No homo, just doing market research (I only invest in companies whose CEO's are packing 8+) Again, no homo.", "Bears can cry but next week is green", "I feel like the least they could do is keep futures open all weekend", "-_-", "I miss making money.  I mean, I never did....but i miss it still you know", "Farted into my hand just so I could feel something", "First, let me hop out the mfkin Porsche 😤", "Im here for the weird shit", "!banbet spy +2% 1d", "I don't get why I don't win the Powerball or Mega Millions jackpots, so rigged and illogical.", "Anyone have a feeling of dread suddenly? Something is up. Spidey-senses 🕷. Prepare for some bad new tomorrow, boys.\n\n✌", "Pfft if only those losers out there partying or sleeping after spending time with their families and friends knew what they were missing right now.", "The brain really is kind of like a muscle, but unfortunately for me, I skipped brain day every day for almost 20 years.", "Vix structure went into backwardation and vix options was 7x the average daily volume y'day, pay attention ![img](emote|t5_2th52|18632)![img](emote|t5_2th52|18632)![img](emote|t5_2th52|18632)", "Pro-tip:\n\nIf it sounds too good to be true, its just your lucky day. Congrats!", "Found my step sisters best friends stuck under a couch today. I had sex with them, obviously.", "Fish starting to come back down to my end of the lake for the winter ![img](emote|t5_2th52|29637)", "Time to 🔒 in some bets boys", "Gaza escalating FAST, shiet getting bad ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)", "Anyone want me to go to Gaza or Israel border or some shid and shitpost from the ground? I wonder how their sewer systems are. Can they handle toilet paper well? Do they sell soothing Anus cream?", "Nutri grain bar and a Mountain Dew", "I eat pieces of shit like you for breakfast", "Damn, Colorado blew that game last night? WTF?", "Normally ugly women get hotter with age but Caroline Ellison has bucked that trend for sure.", "#IMA START SELLING CASH SECURED PUTS NOW", "I really like that mad money guy, he's a real straight shooter.", "\"poverty is just a mindset\", he said waiting at the breadline", "I get insecure when a chick I recently randomly hooked up with (met same night, no tinder or dating app\nOr website or whatever. Just at a bar) a few nights ago, doesn’t reply when you invite her over again. She did have a ring on her finger with a big rock but she said she was divorced…. Whatever. Better than nothing", "told my wife to remind me to buy apple on monday. She pointed at the bowl of apples in the kitchen with a wtf face", "According to Israeli Channel 12 the Israeli ground attack to storm the Gaza Strip will begin tonight.", "#imagine not using large obnoxious font in the weekend 🅱️read 🫵🤡", "![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)", "Dame I woke up from my nap and missed out on all the fun 😳", "Hamas attacked the sun.", "I just saw the eclipse. I am a born again Christian now", "Is it cultural appropriation if I gave my white child a cultured name, say Devonte for example?", "Just saw a WSB post\n\n“I bought ATVI $95 and $100 calls. Will I make any money out of the $95 a share acquisition?”\n\n![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "just drove past a cemetery. had to be 200 cars there for someone's funeral. I don't think more than like 25 people would show up for mine lol", "Drank too much last time on empty stomach and now I can’t stop throwing up 🤮", "I dont post here anymore", "Neighbors having an open house today. Might waltz over to take a dump in their bathroom and not flush then casually leave idk.", "Monday if Oil go up, then stock market go down and if Oil go down, then stock market go up. There may be a little short Squeeze to $SPY 437$ if Oil go down below 83$ ![img](emote|t5_2th52|12787)", "last week bers were hoping the israel war would save their puts. now its taliban looking for investors in china? ![img](emote|t5_2th52|4260)", "iran saying they will intervene in gaza... get popcorn ready", "France raises alert level over the country", "Earnings are good to recover your losses if you’re right.\n$100,000 can be recovered.", "I'll be right back.  Going to fill up my tank real fast.", "The Europoors do love their stabbings don't they", "Little regards finally getting bullish again right in time for WW3", "The euro poors and gas station owners don’t want to fight the USA. We are at least 100 years ahead of them 😤", "Perfect day here to get the family together. Got them all in the Chrysler Pacifica headed to the mall to check out Mr Meeseeks", "It is so bearish in here..my puts are fucked", "It appears puts will pay next week.  2nd carrier to Mediterranean. \n\nhttps://abcnews.go.com/International/exclusive-us-send-2nd-aircraft-carrier-eastern-mediterranean/story?id=103984246", "If WSB users had the power to make geopolitical decisions we'd all be dead by now", "Gamecocks blew 10 pt lead in the 4th qtr classic sc, at least I won some money cause I always bet on whoever sc plays , cause if they win I won’t care about losing the money", "All this war stuff is depressing.", "How to ask u/Hl_IM_MR_MEESEEKS to eat my 🅱️uttcheeks during the 🅿️eekend 🤔", "Young generation too pussy to make a big change like people did in the past. Too depressed and low in test", "Good moaning 🥱", "#Holy lee Fook \n\n\nWent to store grocery \n\nGot some ham and chicken and sour dough bread and yogart \n\nAlmost 47$\n\n\nWtf \n\nIf I had a nagging wife and kids that would be 150$ easy with tax \n\nLike bro \n\n\nThen men wonder why I go to Colombia every 2 months and have sec with Latina booty g string for 40$ usd each \n\n\nLike come on man \n\n\nHave a friend who wife called the cops on him even tho she hit him \n\nAnd now he has a court order to leave his house and can only visits kids every other Saturday and Sunday 🤣 lmao \n\n\n\nChild suport next garnish of wages \n\n#apple 182$ calls 11/10", "A bitch will have 3 abortions and still not hold your Glock in her purse, mfer you the killa not me", "⠀⠀⠀⠀⠀⠀⣠⡀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠤⠤⣄⣀⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢀⣾⣟⠳⢦⡀⠀⠀⠀⠀⠀⠀⢸BULLS⠉⠉⠉⠉⠉⠒⣲⡄ ⠀⠀⠀⠀⠀⣿⣿⣿⡇⡇⡱⠲⢤⣀⠀⠀⠀⢸⠀FUCKED⠀⣠⠴⠊⢹⠁ ⠀⠀⠀⠀⠀⠘⢻⠓⠀⠉⣥⣀⣠⠞⠀⠀⠀⢸⠀⠀⠀⠀⢀⡴⠋⠀⠀⠀⢸⠀ ⠀⠀⠀⠀⢀⣀⡾⣄⠀⠀⢳⠀⠀⠀⠀⠀⠀⢸⢠⡄⢀⡴⠁⠀⠀⠀⠀⠀⡞⠀ ⠀⠀⠀⣠⢎⡉⢦⡀⠀⠀⡸⠀⠀⠀⠀⠀⢀⡼⣣⠧⡼⠀⠀⠀⠀⠀⠀⢠⠇⠀ ⠀⢀⡔⠁⠀⠙⠢⢭⣢⡚⢣⠀⠀⠀⠀⠀⢀⣇⠁⢸⠁⠀⠀⠀⠀⠀⠀⢸⠀⠀ ⠀⡞⠀⠀⠀⠀⠀⠀⠈⢫⡉⠀⠀⠀⠀⢠⢮⠈⡦⠋⠀⠀⠀⠀⠀⠀⠀⣸⠀⠀ ⢀⠇⠀⠀⠀⠀⠀⠀⠀⠀⠙⢦⡀⣀⡴⠃⠀⡷⡇⢀⡴⠋⠉⠉⠙⠓⠒⠃⠀⠀ ⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⡼⠀⣷⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⡞⠀⠀⠀⠀⠀⠀⠀⣄⠀⠀⠀⠀⠀⠀⡰⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⢧⠀⠀⠀⠀⠀⠀⠀⠈⠣⣀⠀⠀⡰⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀", "I will make all losses back over weekend via crypto then take those profits back to stock market Monday![img](emote|t5_2th52|4258)", "I miss Jihad Friday already.", "Redditors are experts in historical middle eastern conflict zones and religion and military tactics now", "Read the entire weekend thread. Now i have aids", "Bro I cant find Palestine in the world map.", "firest", "2nd", "Lulu added to sp 500. Becky carrying us to new highs eod the year ![img](emote|t5_2th52|8882)", "#first \n\nFlair me \n\n\nEdit: thanks 🌈 mods", "Happy weekend 🥂🥂✨", "First person to comment gets a flair.. go..", "Peeing on my neighbors fence rn", "STDs making a comeback.... All the cool kids got them now", "What’s the news with LULU?  Up 4.8% after hours", "she said she won’t give me head to the tony hawk pro skater 2 soundtrack ![img](emote|t5_2th52|27421)", "When I was a kid, my dad used to beat me ![img](emote|t5_2th52|4260)\n\n&#x200B;\n\nat tic-tac-toe ![img](emote|t5_2th52|4271)\n\n&#x200B;\n\nwith a belt ![img](emote|t5_2th52|27421)", "CNBC should fire everyone except a film crew and Rick Santenlli.\n\nthey should stream him 24/7, they should even follow him into the shiiter so they can broadcast his shit talks.", "What is it called when you motorboat a boner?", "My wife has a weird habit of starting conversations by saying \"Are you even listening to me?\"", "Need to motorboat some huge titties", "A girl sent me nudes and she has spider web tattoos around her nipples ![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31226)", "the fact that we went without a weekend thred for HOURS calls for a serious discussion about the mods mental wellbeing. Its like that one guy who shutdown in the middle of a conference with reporters..", "Go to doctor’s appointment. Leave. Get sent a bill for literally whatever charges and amounts the office wants to charge. Call overseas billing department to correct bill for services that were not received and insurance doesn’t cover. Overseas billing checks themselves and determines the bill is correct. Refuse to pay for service not received. Get sent to collections. 💯", "So when we go to war who’s gonna fight since only 18 percent of our population is even eligible for service", "Hope all you degens have a safe and fun weekend! ![img](emote|t5_2th52|4278)", "Finna eat a large stuffed crust pizza by myself like I’m 18 again.", "IM SO HORNY GUYS HELP", "I give gold when I see the word coke", "People really passing on a mcchicken to buy a gold award", "The first Jeepers creepers is on, classic Justin long", "Whenever the market up .5% my portfolio goes up .4%. When the market goes down .5% my portfolio goes down 2%. At some point I’ll need someone to explain", "So whatever happened to day of jihad?", "About to light up this cinnamon apple whatever candle and smoke a doobie\n\nRIP Pimp C", "you know what sucks?\n\n>!me for $20!<", "Time to go eat a triple bypass cheeseburger with super sized drink....then take an Ozempik to stay in shape", "[deleted]", "Imagine thinking people would watch a concert rerun at a movie theatre…\n\n\nMe driving by an AMC…. Holy mother of god…", "sometimes you hold over the weekend to feel something \n\n•sun tzu", "Fuck it I am not having kids. I don't care if I end my bloodline. What benefit do kids even provide to us adults? Plus I would rather not be an embarrassment to the kids so I will not be having them. My wife will need to agree to this when I find her in the next 6 years.", "Look at all these instagram models up in here 👌🏻😮‍💨", "Some of the gals on r/Tightdresses needs to lay off the beer and fried food, and start going to the gym", "SAAWannngggggg and a miss", "BigBoiBenisBlueBalls", "Ima eat your ass", "Wen Call of Duty Ukraine and Call of Duty Gaza? LMAO🤌", "Im surprised Gal Gadot ain’t singing?", "Apparently Tuesday is the big day", "I just spent the day giving out thousands to u guys in options and then just handed out $140 in Reddit gold. You guys better pull through for me in my retirement", "Remember. Bank failures only occur on weekends", "Promise me", "Don't promise me", "Nothing ruins my walk in the park more than seeing a bench dedicated to someone. Now I’m sad at 9 am when I just wanted to tie my shoes.", "U/redditismanipulating is carrying this chat on his back tonight", "21", "Know that you are loved 🤗\n\n^^^^^^By ^^^^^^a ^^^^^^really ^^^^^^unattractive ^^^^^^dude", "hood rich, so I never had a bank account", "She will be loved.\n\nBy another man. ![img](emote|t5_2th52|32777)", "*Hose in this house, theres some hose in this house*", "Yoga pants to the 🌕🚀🚀🚀", "surely blasting the Gazans will lead to less terrorism", "JUST GO TO SLEEP", "#💩🥪🙏", "Hello.... HELLO?????", "Wizard: “You can see 3 seconds into the future”\n\nNormal people: “Aw man. I don’t know what I can do with that power”\n\nWSB: ![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)", "Just checked out the r/Ozempic sub and everybody still look fat. Its a bubble ...and not just the users. \n\nI'm shorting LLY on monday", "About that time to send a hey you up text", "I like turtles", "“How much does the whole earth cost? \nI’m going to buy the whole earth”\n\n- Kanye west and me in the mirror after making a $78 profit trade", "First time shit posting in late night weekend thread.", "I refuse to believe anyone actually enjoys Valorant. Like it has to be some sort of psyop", "I went to the store to get some milk and theres a naked dude with weird sunglassed on beating off in the sprinklers. ![img](emote|t5_2th52|4640)", "why did the math book look sad / because it had to mant problems", "I’m at an actual casino right now.\n\nI literally don’t know how this is any different than the stonk market. ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|12787)", "#P A N I C", "![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)", "Ok Colorado, second time this season I’m up until 2 watching you 🫡🙏🏻", "Buying 0dtes that expired worthless ![img](emote|t5_2th52|8883)\n\nPaying for electric ![img](emote|t5_2th52|27421)", "How did it go for you after ending an ltr?", "Are you duck footed?\n\nhttps://preview.redd.it/lr49abgq64ub1.jpeg?width=864&format=pjpg&auto=webp&s=b63f3131c749f9897205def2c18f724996b2942c", "[deleted]", "No rogue gear dropped in MC ![img](emote|t5_2th52|12787)", "Caroline Ellison has the most hilariously repulsive courtroom sketches\n\n[https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/10/931/523/Sam-Bankman-Fried-Court-Sketch-FTX\\_14.jpg?ve=1&tl=1](https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/10/931/523/Sam-Bankman-Fried-Court-Sketch-FTX_14.jpg?ve=1&tl=1)", "To all regards,\n\nJeremy Powell aka BigDickEnergy is doing Magic Mike show on  Thursday, October 19, 2023.\n\nGet front rows ![img](emote|t5_2th52|4275)", "Inside you are two presidents\n\nIt’s JOeVER\n\nWe’re BArraCK", "What's the point of having fuck you money, if you never get to say fuck you.\n\n*Yea, I'll have the extra avocado...........peasant*", "going to walgreens\n\nwant some yogurt covered pretzels", "happy birthday", "Another new day, what does this mean for you?", ">  FRENCH GOVERNMENT HAS ORDERED THE DEPLOYMENT OF UPWARDS OF 7,000 SOLDIERS ACROSS THE COUNTRY FOLLOWING MASS PRO-PALESTINIAN/HAMAS DEMONSTRATIONS", "Puts man. They’re going to be 100 baggers 😩", "Lol all that fear mongering last weekend and the week ended  being green. Now regards are at it again this weekend. Market doesn't give two shits about this conflict. It's not Ukraine/Russia.", "Think I might buy a Honda Ruckus to cruise around town. Anyone here had one and recommend? ![img](emote|t5_2th52|12787)", "How have you guys been?", "What?!  Stanford won.  It was 22 to 0 when I went to bed.\n\nPrime Time forgot how to play defense.", "The obvious solution to peace in the Middle East is to divvy it up into 14 equal parts and run an NBA style lottery. No one complains about what ping pong balls decide. \n\nParts with religious significance go in first round.", "As usual bears don’t get it \n\nThe more the War rages the more bullish it is, \n\nMoney printer goes brrrrrr", "*I’m not a perfect personnn*", "It is window sill pie swiping season", "Too many finance sub advise selling blood for money, I m thinking this is a vampire conspiracy", "My NVDA puts came back from complete death ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "Zinc supplementation could significantly increase the semen volume, sperm motility and percentage of normal sperm morphology of infertile males, suggesting that zinc supplementation might increase male reproductive function.", "Don’t eat zinc it will make your semen way too loud with volume increase", "Next time someone at the bar starts acting hard and trying to start shit, just look him dead in the eye and in a deadpan voice say, “you know I’m gonna fuck you in the butt when I knock you out, right?”", "Singapore’s largest bank crashed due to a datacentre outage. People cannot access their money for the past 8 hours or so.", "It's the weekend and some of you still plan to lose money", "These college football players are now born the year I graduated high school  ![img](emote|t5_2th52|4260)", "Buenos días, guapos ![img](emote|t5_2th52|8882)", "Hey! I know you! I totally pegged you with a D battery at Shea Stadium in 1987", "feeling a giant shit coming on. gonna go to the empty JCPenney bathroom", "This solar eclipse is trippy man", "I Lulu therefore I am", "#parlay vouz futbol americano", "bought some mandarin cookies from the dispensary. Gonna report back. Doobie time ![img](emote|t5_2th52|8883)", "Is harem haram?", "Do your math bros\n\n[https://www.youtube.com/watch?v=i1WOaGmz6DE](https://www.youtube.com/watch?v=i1WOaGmz6DE)", "Time to shake the cheese sticks in the air fryer", "My savings account’s biggest opp is my margin account", "beef jerky so expensive imma just buy the meat and jerk it myself", "I think I'm either an incel or becoming one", "I kinda wish I'd stay single tbh. I could live in a shack with no headaches. Damn this 🅿️🅿️", "Some of you here will jerk off in public for a rib eye steak sandwich", "America should have suicide assisted facilities and charge for services...\n\nAmerica can make money off suicidal people... \n\nBut that would mean less people on WSB", "Lol $550 to bet on Logan Paul and win $100, reminds me of selling a very in the money spread", "This whole choose your side thing is starting to feel like this generations “Edward or Jacob” campaign. \n\nJust waiting for BK to drop their Israel/Palestine cups now for their next “choose your team” promo.", "Oh shit Colorado blew at 29 point half time lead ![img](emote|t5_2th52|4267)", "If next week TSM and ASML Earning is good then NVDA probably go above 480$....![img](emote|t5_2th52|12787)", "microsoft \n\nWe mailed the tax cheque ages ago IRS must have lost it", "BERS getting mutilated EOY", "Were you buds born with the gay lisp or nah?", "#Anchors aweigh! 🇺🇸", "Iran only intervening for that Mia Khalifa pussy", "The weekend would be so much better if we could trade options ![img](emote|t5_2th52|4260)", "I’ve just learned about straddles - you people really need to advertise these more, they sound great!", "Eating some wings, drinking some beer, hanging out with the boys listening to some Jason Aldean... This is a pretty solid Sat", "> PFIZER SHARES ARE NOW BACK BELOW PRE COVID LEVELS", "Ok so if Iran is legit serious and joins the war + shuts down the straight of Hormuz - is SPY fucked or nah ?", "I was tripping balls during the eclipse.  It was sunnny but also felt dark 🤯", "Kitty laying in my lap rn", "Yo bro who the fuck has my juul, i just put it on the charger\n\nnot funny guys\n\neveryone empty your pockets", "Me yelling at the game on tv like I yell at my options.\n\n# C'ome on you f*ckers, RUN!", "![img](emote|t5_2th52|32777)", "The power of my rally dance is frightening.", "Wtf am I supposed to be doing?", "Feels bad living in California and not being able to place bets ![img](emote|t5_2th52|4260)", "Dillion vs Logan was the saddest fight I’ve ever seen in my life", "You ever squeeze a boob?", "Too many bears in here. We're bullish Monday hulk dick ![img](emote|t5_2th52|4276)"]}, {"title": "Most Anticipated Earnings Releases for the week beginning October 16th, 2023", "body": "", "opinions": ["Finally, an actual earnings week 😎", "Definitely gonna do a deep dive on TSLA and NFLX", "lockheed ?", "WD-40 is listed?\n\nI have a new favorite stock.", "All in Lockheed Martin 🫠", "Tesla ![img](emote|t5_2th52|4258)", "I just bout 0dte SPY OTM puts. Bottom is in!", "Anyone else see the F-22 raptor vid on front page today?\n\nLMT baby", "Tesla 📞", "All In on NFLX calls", "LMT 🚀🚀🚀", "Implied moves :\n\n&#x200B;\n\n$TSLA 7.1%\n\n$NFLX 8.4%\n\n$LRCX 6.8%\n\n$LVS 5.6%\n\n$T 5.2%\n\n$AAL 7.4%\n\n$FCX 5.3%\n\n$NOK 7.4%\n\n$UNP 4.1%\n\n$PM 3.5%\n\n$POOL 7.2%\n\n$IRDM 9.3%\n\n$ISRG 8.6%\n\n$CSX 4.2%\n\n$AXP 4.5%\n\n$WDFC 6.9%\n\n$BAC 5.3%\n\n$MS 5.0%\n\n$ABT 5.1%\n\n$ALLY 7.2%\n\n$LMT 3.9%\n\n$GS 4.4%\n\n$JNJ 3.0%\n\n$PG 3.9%\n\n$NDAQ 3.8%\n\n$TRV 3.8%\n\n$AA 8.4%\n\n$DFS 6.4%\n\n$PPG 4.6%\n\n$SAP 4.4%\n\n$UAL 7.3%\n\n$IBKR 4.9%\n\n$JBHT 4.3%\n\n$ASML 5.3%\n\n$SCHW 7.7%", "TSLA price targets   \nvvvvvvvvvvvvvvvvv", "So many losses to come.  The excitement builds!!", "WD40 210c", "Short-term Oversold signal on Citi is currently showing a 5% performance gain, and there is still potential for the stock to continue rallying. Selling 39$ puts", "Puts on NFLX", "LMT Tuesday premarket 🚨", "Bank of america calls, Tesla puts, netflix puts, american airlines puts.", "come on BAC!", "Man, I miss the early days of 2022 when Netflix was falling 30% two earning calls in a row, each giving me 10x bangers ![gif](emote|free_emotes_pack|cry)", "Oh my sweet lord", "BURN BABY BURN", "It’s beautiful 🥹 earnings season is back ![img](emote|t5_2th52|29637)", "Calls on Ally? CEO departure news caused a selloff but with recent bank earnings coming in hot I'm thinking it could be oversold.", "To all regards,\n\nJeremy Powell aka BigDickEnergy is doing Magic Mike show on  Thursday, October 19, 2023.\n\nGet front rows \n\n![img](emote|t5_2th52|4275)", "Israeli here. Some inside information for you guys because I always liked you: we gonna nuke everyone except Tesla(we like Elon). I’m not joking. We are done with this BS.\n\nEdit: sorry wrong thread", "Who is going to moon", "Netflix calls but maybe don’t hold through earnings.", "Puts on Netflix", "Calls on war", "Hot damn it, this is loaded!", "📞LMT 🚀🌙", "Lockheed will dive after earnings, they already in the top of their price", "Nice work making these. Very helpful.", "Lowkey feeling like YOLOing into Tesla", "NFLX ded", "Is Tesla stock going to take off when cybertruck finally launches?", "Where is Zions Bankcorporation?", "Wednesday should be interesting..", "Wonder if Scott Kirby and Ted Cancun Cruz will be fleeing together on a trip somewhere while abandoning their employers.", "COME ON SCHW TFC AND TSM. please", "We’re in for one hell of a week", "Man Amex has been killing it with me lately. Thinking about yoloing.", "This week is going to be crazy. Calls on TSLA. Puts on NFLX", "On a side note, companies that release earnings on Monday mornings suck!", "I think JNJ is gonna take a massive hit.", "Puts on Schwab while using the Charles Schwab app", "I hope my TSLA $450 calls expiring 10/20 print. 🚀🤑", "NIO was $15 few months back \nNIO delivery went to 20,000 units per week approx. \n\nThis stock will go up", "Puts on tsla and nflx. Calls on wal and lmt", "Here is my due diligence on Lockheed Martin ahead of its earnings report this week:\n\t•\tLockheed Martin is a leading global aerospace and defense company that provides products and services for military, civil, and commercial customers. The company operates in four business segments: Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space.\n\n\t•\tThe company reported strong financial results in the second quarter of 2023, with net sales of $16.7 billion, an increase of 8% year-over-year, and net earnings of $1.7 billion, or $6.63 per share, an increase of 471% year-over-year. The company also increased its full year outlook for sales, segment operating profit, and earnings per share.\n\n\t•\tThe company has a record backlog of $158 billion, which provides visibility and stability for its future revenue and cash flow. The company’s backlog is driven by its signature programs, such as the F-35 fighter jet, the PAC-3 missile defense system, the GMLRS rocket system, the Orion spacecraft, and the THAAD missile system.\n\n\t•\tThe company faces some competitive and operational challenges, such as the pressure to reduce costs and improve efficiency, the uncertainty of the defense budget and spending priorities, the impact of the COVID-19 pandemic on its supply chain and workforce, and the technological disruption and innovation in the aerospace and defense industry.\n\n\t•\tThe company’s valuation is attractive compared to its peers and historical averages. The company’s stock price is currently trading at $378.45 per share, which implies a price-to-earnings ratio of 14.2 based on its trailing 12-month earnings. This is lower than the industry average of 18.4 and the S&P 500 average of 28.9. The company also pays a dividend yield of 2.8%, which is higher than the industry average of 1.5% and the S&P 500 average of 1.3%\n\n🤷‍♂️", "I’m loaded with scwb puts for next week and march 2024, up so far", "LMT has pumped so much already that it's not going to keep pumping unless earnings are stellar", "BAC calls?", "What does after close mean?", "What does call and puts mean? I couldn’t find it in community notes.", "I don't understand, if travel is exploding why the price of GBTG is dropping, eventually it has to go up right", "Lmt calls look expensive af. You need something like 475c on the weekly unless you wanna risk a few grand", "ASML is not on the list", "not just this even big indian companies like infosys and HCL are announcing theyre earnings this week ...", "What’s the hot 5 this week?"]}]